app/controllers/home_controller.rb

  def index
    @products = Product.all
---
SELECT `products`.* FROM `products`